In [233]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\hp\anaconda3\lib\site-packages (2.9.9)Note: you may need to restart the kernel to use updated packages.

In [234]:
import psycopg2
import pandas as pd

In [235]:
# def create_database():
#     # Connect to the default database
#     conn = psycopg2.connect('host=127.0.0.1 dbname=postgres user=postgres password=feranmi')
#     conn.set_session(autocommit=True)
#     cur = conn.cursor()
    
#     # Drop the 'accounts' database if it exists and create a new one
#     cur.execute('DROP DATABASE IF EXISTS accounts')
#     cur.execute('CREATE DATABASE accounts')
#     conn.close()
    
#     # Connect to the 'accounts' database
#     conn = psycopg2.connect('host=127.0.0.1 dbname=accounts user=postgres password=feranmi')
#     cur = conn.cursor()  # Ensure parentheses are used here
#     return cur, conn

In [236]:
def create_database():
    conn = psycopg2.connect('host = localhost dbname = postgres user = postgres password=feranmi')
    conn.set_session(autocommit=True)
    cur = conn.cursor()
    
    cur.execute("""
    SELECT pg_terminate_backend(pg_stat_activity.pid)
    FROM pg_stat_activity
    WHERE pg_stat_activity.datname = 'accounts'
    AND pid <> pg_backend_pid();
    """)
    
    cur.execute('DROP DATABASE IF EXISTS accounts')
    cur.execute('CREATE DATABASE accounts')
    conn.close()
    
    conn = psycopg2.connect('host = 127.0.0.1 dbname = postgres user = postgres password=feranmi')
    cur = conn.cursor()
    return cur, conn

In [237]:
def drop_tables(curr,conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

In [238]:
def drop_table(curr,conn):
    for query in create_table_queries:
        cur.execute(query)
        conn.commit()

In [239]:
country_df = pd.read_csv('Wealth-AccountsCountry.csv')

In [240]:
country_df.head(2)

,Code,Long Name,Income Group,Region,Lending category,Other groups,Currency Unit,Latest population census,Latest household survey,Special Notes,...,Source of most recent Income and expenditure data,Vital registration complete,Latest agricultural census,Latest industrial data,Latest trade data,Latest water withdrawal data,2-alpha code,WB-2 code,Table Name,Short Name
0,ALB,Republic of Albania,Upper middle income,Europe & Central Asia,IBRD,NaN,Albanian lek,2020 (expected),"Demographic and Health Survey, 2017/18",NaN,...,Living Standards Measurement Study Survey (LSM...,Yes,2012,2013.0,2018.0,2006.0,AL,AL,Albania,Albania
1,ARG,Argentine Republic,Upper middle income,Latin America & Caribbean,IBRD,NaN,Argentine peso,2020 (expected),"Multiple Indicator Cluster Survey, 2019/20",NaN,...,"Integrated household survey (IHS), 2016",Yes,2008,2002.0,2018.0,2011.0,AR,AR,Argentina,Argentina

In [241]:
df1 = country_df[['Code','Short Name','Table Name','Long Name','Currency Unit']]

In [242]:
df1.head(3)

  Code Short Name Table Name            Long Name   Currency Unit
0  ALB    Albania    Albania  Republic of Albania    Albanian lek
1  ARG  Argentina  Argentina   Argentine Republic  Argentine peso
2  ARM    Armenia    Armenia  Republic of Armenia   Armenian dram

In [243]:
accountsData= pd.read_csv('Wealth-AccountData.csv')

In [244]:
accountsData.head(3)

,Country Name,Country Code,Series Name,Series Code,1995 [YR1995],1996 [YR1996],1997 [YR1997],1998 [YR1998],1999 [YR1999],2000 [YR2000],...,2009 [YR2009],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017],2018 [YR2018]
0,Albania,ALB,Human capital (constant 2018 US$),NW.HCA.TO,4.49E+10,4.34E+10,3.71E+10,3.88E+10,4.22E+10,4.36E+10,...,6.610000e+10,6.810000e+10,6.850000e+10,7.080000e+10,7.160000e+10,7.250000e+10,7.370000e+10,7.57E+10,7.80E+10,8.12E+10
1,Albania,ALB,Human capital per capita (constant 2018 US$),NW.HCA.PC,14072.79,13708.99,11794.1,12399.48,13573.26,14118.13,...,2.258200e+04,2.336286e+04,2.359058e+04,2.439397e+04,2.473162e+04,2.509002e+04,2.559371e+04,26326.26,27160.86,28333.68
2,Albania,ALB,"Human capital per capita, employed female (con...",NW.HCA.FEMP.PC,3468.858,3355.549,2868.997,3013.391,3259.893,3424.007,...,2.825336e+03,2.889150e+03,2.848523e+03,2.930234e+03,2.954273e+03,2.957420e+03,2.987545e+03,3072.504,3178.417,3312.927

In [245]:
df1.head(2)

  Code Short Name Table Name            Long Name   Currency Unit
0  ALB    Albania    Albania  Republic of Albania    Albanian lek
1  ARG  Argentina  Argentina   Argentine Republic  Argentine peso

In [246]:
accountsData.columns

Index(['Country Name', 'Country Code', 'Series Name', 'Series Code',
       '1995 [YR1995]', '1996 [YR1996]', '1997 [YR1997]', '1998 [YR1998]',
       '1999 [YR1999]', '2000 [YR2000]', '2001 [YR2001]', '2002 [YR2002]',
       '2003 [YR2003]', '2004 [YR2004]', '2005 [YR2005]', '2006 [YR2006]',
       '2007 [YR2007]', '2008 [YR2008]', '2009 [YR2009]', '2010 [YR2010]',
       '2011 [YR2011]', '2012 [YR2012]', '2013 [YR2013]', '2014 [YR2014]',
       '2015 [YR2015]', '2016 [YR2016]', '2017 [YR2017]', '2018 [YR2018]'],
      dtype='object')

In [247]:
df2 = accountsData[['Country Name','Country Code','Series Name','1995 [YR1995]','2005 [YR2005]']]

In [248]:
df2.head()

,Country Name,Country Code,Series Name,1995 [YR1995],2005 [YR2005]
0,Albania,ALB,Human capital (constant 2018 US$),4.49E+10,5.440000e+10
1,Albania,ALB,Human capital per capita (constant 2018 US$),14072.79,1.807230e+04
2,Albania,ALB,"Human capital per capita, employed female (con...",3468.858,2.222115e+03
3,Albania,ALB,"Human capital per capita, employed male (const...",6507.931,1.168935e+04
4,Albania,ALB,"Human capital per capita, female (constant 201...",4893.006,2.886736e+03

In [249]:
series = pd.read_csv('Wealth-AccountSeries.csv')

In [250]:
series.head(3)

,Code,Indicator Name,Long definition,Source,Topic,Unit of measure,Periodicity,Reference period,Statistical concept and methodology,Previous Indicator Code,Previous Indicator Name
0,NW.HCA.TO,Human capital (constant 2018 US$),Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN
1,NW.HCA.PC,Human capital per capita (constant 2018 US$),Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN
2,NW.HCA.FEMP.PC,"Human capital per capita, employed female (con...",Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN

In [251]:
df3 = series[['Code', 'Topic','Indicator Name','Periodicity']]

In [252]:
df3.head()

,Code,Topic,Indicator Name,Periodicity
0,NW.HCA.TO,Human capital,Human capital (constant 2018 US$),Annual
1,NW.HCA.PC,Human capital,Human capital per capita (constant 2018 US$),Annual
2,NW.HCA.FEMP.PC,Human capital,"Human capital per capita, employed female (con...",Annual
3,NW.HCA.MEMP.PC,Human capital,"Human capital per capita, employed male (const...",Annual
4,NW.HCA.FEMA.PC,Human capital,"Human capital per capita, female (constant 201...",Annual

In [253]:
cur, conn = create_database()

In [254]:
songplay_table_create = (""" CREATE TABLE IF NOT EXISTS accountscountry(
country_code VARCHAR PRIMARY KEY,
short_name VARCHAR,
table_name VARCHAR,
long_name VARCHAR,
currency_unit VARCHAR)""")

In [255]:
cur.execute(songplay_table_create)
conn.commit()

In [256]:
songplay_table_create = (""" CREATE TABLE IF NOT EXISTS accountsdata1(
country_name VARCHAR,
country_code VARCHAR,
indicator_name VARCHAR,
year_1999 VARCHAR,
year_2015 numeric)""")

In [257]:
cur.execute(songplay_table_create)
conn.commit()

In [258]:
songplay_table_create = (""" CREATE TABLE IF NOT EXISTS accountseries(
series_code VARCHAR,
topic VARCHAR,
periodicity VARCHAR,
indicator_name VARCHAR)""")

In [259]:
conn.rollback()

In [260]:
cur.execute(songplay_table_create)
conn.commit()

In [261]:
accountscountry_insert = ("""INSERT INTO accountscountry(
country_code,
short_name,
table_name,
long_name,
currency_unit)
VALUES (%s,%s,%s,%s,%s)
ON CONFLICT (country_code) DO NOTHING;
""")

In [262]:
df1 = df1.fillna('Unknown')

In [263]:
cur.execute("DELETE FROM accountscountry;")
conn.commit()

In [264]:
for i, row in df1.iterrows():
    cur.execute(accountscountry_insert,list(row))

In [265]:
conn.commit()

In [266]:
df2.dtypes

Country Name      object
Country Code      object
Series Name       object
1995 [YR1995]     object
2005 [YR2005]    float64
dtype: object

In [267]:
accountsdata_insert = ("""INSERT INTO accountsdata1(
country_name,
country_code,
indicator_name,
year_1999,
year_2015)
VALUES (%s,%s,%s,%s,%s)
""")

In [268]:
for i, row in df2.iterrows():
    cur.execute(accountsdata_insert,list(row))

In [269]:
conn.commit()